HarryVienna/Waveshare-ESP32-P4-Module-DEV-KIT-C-LVGL-Demo/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- Chip Revision (ESP32-P4 rev <3.0 and >=3.0 are mutually exclusive) ---
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Partition Table ---
CONFIG_PARTITION_TABLE_CUSTOM=y

# --- Compiler ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- PSRAM ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# --- Cache (optimized for display performance) ---
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# --- FreeRTOS ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000

# --- Experimental features (required for ESP32-P4 MIPI DSI) ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- LVGL Configuration ---
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_DISP_DEF_REFR_PERIOD=15
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# Fonts for LVGL
CONFIG_LV_FONT_MONTSERRAT_48=y